app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
    def index
        @posts = Post.paginate(page: params[:page],per_page: params[:limit])