app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(page: params[:page],per_page: params[:limit])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "chungletrong"], ["password_digest", "$2a$10$H40/7ikopG8s74X.7zfUY.TdSzx9dA2gFidJbVAM5HVYD7mwKrYtq"], ["updated_at", "2019-06-17 11:56:03.177062"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)